---
title: DistributionSysTypeSet
classe: Autodesk.Revit.DB.Electrical.DistributionSysTypeSet
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# DistributionSysTypeSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `distributionSysTypeSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `distributionSysTypeSet.Size` | Int32 |
| `Void Clear()` | `distributionSysTypeSet.Clear()` | Void |
| `Boolean Contains(DistributionSysType)` | `distributionSysTypeSet.Contains(item)` | Boolean |
| `Int32 Erase(DistributionSysType)` | `distributionSysTypeSet.Erase(item)` | Int32 |
| `DistributionSysTypeSetIterator ForwardIterator()` | `distributionSysTypeSet.ForwardIterator()` | DistributionSysTypeSetIterator |
| `IEnumerator GetEnumerator()` | `distributionSysTypeSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(DistributionSysType)` | `distributionSysTypeSet.Insert(item)` | Boolean |
| `DistributionSysTypeSetIterator ReverseIterator()` | `distributionSysTypeSet.ReverseIterator()` | DistributionSysTypeSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```